stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/STM32WBA65I-DK1/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/Core/Src/app_entry.c
  BSP_LCD_DisplayOn(0);

  BSP_LCD_Clear(0,SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  /* Set the LCD Text Color */
  UTIL_LCD_SetFont(&Font12);
  UTIL_LCD_SetTextColor(SSD1315_COLOR_WHITE);
  UTIL_LCD_SetBackColor(SSD1315_COLOR_BLACK);
  BSP_LCD_Refresh(0);

  LCD_DrawBitmapArray(6 , 32, 32, 32, &auracast_logo[0]);
  LCD_DrawBitmapArray(42 , 40, 16, 16, &nok_icon[0]);
  LCD_DrawBitmapArray(70 , 32, 32, 32, &usb_logo[0]);
  LCD_DrawBitmapArray(106 , 40, 16, 16, &nok_icon[0]);

  DrawStatusLCD();

  UTIL_LCD_DisplayStringAt(0, 5, (uint8_t *)"AURACAST SOURCE", CENTER_MODE);

  BSP_LCD_Refresh(0);

  /* release bus for power optimisation */
  BSP_SPI3_DeInit();
}

/* draw an array of bits at the specified offsets starting from corner top left. Ensure xlen is multiple of 8*/
static int32_t LCD_DrawBitmapArray(uint8_t xpos, uint8_t ypos, uint8_t xlen, uint8_t ylen, uint8_t *data){

  int32_t i,j,k;
  uint8_t mask;
  uint8_t* pdata = data;

  if (((xpos+xlen) > 128) || ((ypos+ylen) > 64))
  {
    /*out of screen*/
    return -1;
  }

  for (j=0 ; j < ylen ; j++)
  {
    for (i=0 ; i < xlen/8 ; i++)
    {
      mask = 0x80;
      for (k=0 ; k < 8 ; k++)
      {
        if ( mask & *pdata)
        {
          UTIL_LCD_SetPixel(i*8+k+xpos, j+ypos, SSD1315_COLOR_WHITE);
        }
        else
        {
          UTIL_LCD_SetPixel(i*8+k+xpos, j+ypos, SSD1315_COLOR_BLACK);
        }
        mask = mask >> 1;
      }
      pdata++;
    }
  }

  BSP_LCD_Refresh(0);

  return 0;
}

static void DrawStatusLCDTask(void)
{
  BSP_SPI3_Init();
  DrawStatusLCD();
  BSP_SPI3_DeInit();
}

static void DrawStatusLCD(void)
{
  uint8_t *auracast_state_logo = 0;
  uint8_t *usb_state_logo = 0;
  extern uint8_t ok_icon[];
  extern uint8_t nok_icon[];
  extern uint8_t speaker_icon[];

  switch (gAuracast_state)
  {
    case AURACAST_STATE_OFF:
      /* Draw NOK icon */
      auracast_state_logo = &nok_icon[0];
      break;

    case AURACAST_STATE_CONFIGURED:
      /* Draw OK icon */
      auracast_state_logo = &ok_icon[0];
      break;

    case AURACAST_STATE_STREAMING:
      /* Draw Speaker icon */
      auracast_state_logo = &speaker_icon[0];
      break;
  }

  switch (gUsb_state)
  {
    case USB_STATE_DISCONNECTED:
      /* Draw NOK icon */
      usb_state_logo = &nok_icon[0];
      break;

    case USB_STATE_CONNECTED:
      /* Draw OK icon */
      usb_state_logo = &ok_icon[0];
      break;

    case USB_STATE_STREAMING:
      /* Draw Speaker icon */
      usb_state_logo = &speaker_icon[0];
      break;
  }

  if (auracast_state_logo != 0)
  {
    LCD_DrawBitmapArray(42 , 40, 16, 16, auracast_state_logo);
  }
  if (usb_state_logo != 0)
  {
    LCD_DrawBitmapArray(106 , 40, 16, 16, usb_state_logo);
  }
}
#endif  /* CFG_LCD_SUPPORTED */

/**
  * @brief Configure PLL for the audio frequency, PLL output is used for the SAI peripheral and as the core clock
  * @retval None
  */
void AudioClock_Init(uint32_t audio_frequency_type)
{
  uint32_t target_freq;
  if (audio_frequency_type == SAMPLE_FREQ_44100_HZ)
  {
    target_freq = 90316800;
  }
  else
  {
    /* valid for 8k, 16k, 24k, 32k or 48k */
    target_freq = 98304000;
  }

  if ( target_freq !=  PLL_Target_Clock_Freq )
  {
    scm_pll_config_t pll_config;
    LOG_INFO_APP("Audio Clock Initialization\n");

    pll_config.pll_mode = PLL_FRACTIONAL_MODE;
    pll_config.PLLM = 6;
    pll_config.PLLP = 4;
    pll_config.PLLQ = 4;
    pll_config.PLLR = 4;

    /* VCO frequency should be in range 128 to 544 MHz */
    /* PLL fractionnal should allows to cover +/-550ppm around the targeted frequency*/
    if (target_freq == 90316800)
    {
      pll_config.PLLN = 67;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (67 + 1) = 362.7 MHz */
      pll_config.PLLFractional = 6042;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_3;
      /* PLLSYS = 90.31673 MHz */
    }
    else
    {
      pll_config.PLLN = 73;  /* VCO = HSE/M * N * (1 + Nfrac / 8192) < 32 / 6 * (73 + 1) = 394.7 MHz */
      pll_config.PLLFractional = 5964;
      pll_config.AHB5_PLL1_CLKDivider = LL_RCC_AHB5_DIV_4;
      /* PLLSYS = 98.30396 MHz */
    }

    UTIL_LPM_SetMaxMode(1 << CFG_LPM_AUDIO, UTIL_LPM_SLEEP_MODE);

    scm_pll_setconfig(&pll_config);

    scm_setsystemclock(SCM_USER_APP, SYS_PLL);

    /* enable P output used for the audio timer */
    LL_RCC_PLL1_EnableDomain_PLL1P();

    PLL_Target_Clock_Freq = target_freq;
  }
  else
  {
    LOG_INFO_APP("Audio Clock already configured\n");
  }
}

void PLL_Ready_ProcessIT(void)
{
  UTIL_SEQ_SetTask(1U << CFG_TASK_PLL_READY_ID, CFG_SEQ_PRIO_0);
}

void PLL_Ready_Task(void)
{
  /* set Link Layer audio timings */
  uint32_t iso_exec_time;
  Evnt_timing_t event_time;
  event_time.drift_time    = ISO_PLL_DRIFT_TIME;
  event_time.exec_time     = ISO_PLL_EXEC_TIME;
  event_time.schdling_time = ISO_PLL_SCHDL_TIME;

#if defined(__GNUC__) && defined(DEBUG)
  event_time.drift_time += ISO_PLL_DRIFT_TIME_EXTRA_GCC_DEBUG;
  event_time.exec_time += ISO_PLL_EXEC_TIME_EXTRA_GCC_DEBUG;
#endif

  ll_intf_config_schdling_time(&event_time, &iso_exec_time);

  CODEC_CLK_Init();

  AUDIO_PLLConfig_t pll_config;
  pll_config.PLLTargetFreq = PLL_Target_Clock_Freq;
  pll_config.VCOInputFreq = (32000000.0f / 6.0f); /* HSE / PLL_M */
  pll_config.PLLOutputDiv = 4; /* PLL_P */

  AUDIO_CorrectorConfig_t corrector_config;
  corrector_config.initialMinSampling = 500;
  corrector_config.minSampling = 4000;
  corrector_config.mode = 1; /* this mode is in early release in V1.10 codec manager lib and allows to compensate long term drift using the hardware timestamping */
  AUDIO_InitializeClockCorrector(&pll_config, &corrector_config);
}

void PLL_Exit(void)
{
  if (PLL_Target_Clock_Freq != 0)
  {
    scm_setsystemclock(SCM_USER_APP, NO_CLOCK_CONFIG);

    PLL_Target_Clock_Freq = 0;

    UTIL_LPM_SetMaxMode(1 << CFG_LPM_AUDIO, UTIL_LPM_MAX_MODE);
  }
}

int32_t Start_TxAudio(void)
{
  LOG_INFO_APP("START AUDIO SINK (output)\n");
  return 0;
}

void Stop_TxAudio(void)
{
  /* Nothing to do */
}

