stm32-hotspot/STM32WBA-BLE-USBx-Class-Audio/Projects/STM32WBA65I-DK1/Applications/BLE_USBX/BLE_Audio_Auracast_Ux_Audio/Core/Src/app_entry.c
int PKACTRL_MutexTake(void)
{
  int error = 0;

  /* Check if mutex is available */
  if (0u != PkaMut)
  {
    /* Clear flag */
    UTIL_SEQ_ClrEvt ((1u << CFG_PKA_MUTEX));

    /* Wait for flag to be raised */
    UTIL_SEQ_WaitEvt ((1u << CFG_PKA_MUTEX));
  }

  /* Increment mutex */
  PkaMut++;

  return error;
}

int PKACTRL_MutexRelease(void)
{
  int error = 0;

  if (0u != PkaMut)
  {
    PkaMut = 0u;

    /* Set the flag up */
    UTIL_SEQ_SetEvt ((1u << CFG_PKA_MUTEX));
  }

  return error;
}

int PKACTRL_TakeSemEndOfOperation(void)
{
  int error = 0;

  /* Check if semaphore is available */
  if (0u != EndOfProcSem)
  {
#if (CFG_LPM_LEVEL != 0)
  /* Avoid going in low power during computation */
  UTIL_LPM_SetMaxMode(1U << CFG_LPM_PKA_OVR_IT, UTIL_LPM_SLEEP_MODE);
#endif /* (CFG_LPM_LEVEL != 0) */

    /* Clear flag */
    UTIL_SEQ_ClrEvt ((1u << CFG_PKA_END_OF_PROCESS));

    /* Wait for flag to be raised */
    UTIL_SEQ_WaitEvt ((1u << CFG_PKA_END_OF_PROCESS));
  }

  /* Increment semaphore */
  EndOfProcSem++;

  return error;
}

int PKACTRL_ReleaseSemEndOfOperation(void)
{
  int error = 0;

  if (0u != EndOfProcSem)
  {
    EndOfProcSem = 0u;

    /* Set the flag up */
    UTIL_SEQ_SetEvt ((1u << CFG_PKA_END_OF_PROCESS));

#if (CFG_LPM_LEVEL != 0)
  /* Restore low power */
  UTIL_LPM_SetMaxMode(1U << CFG_LPM_PKA_OVR_IT, UTIL_LPM_MAX_MODE);
#endif /* (CFG_LPM_LEVEL != 0) */
  }

  return error;
}

FM_Cmd_Status_t FM_MutexTake(void)
{
  FM_Cmd_Status_t error = FM_OK;

  /* Check if mutex is available */
  if (0u != FlashMut)
  {
    /* Clear flag */
    UTIL_SEQ_ClrEvt ((1u << CFG_FLASH_MUTEX));

    /* Wait for flag to be raised */
    UTIL_SEQ_WaitEvt ((1u << CFG_FLASH_MUTEX));
  }

  /* Increment mutex */
  FlashMut++;

  return error;
}

FM_Cmd_Status_t FM_MutexRelease(void)
{
  FM_Cmd_Status_t error = FM_OK;

  if (0u != FlashMut)
  {
    FlashMut = 0u;

    /* Set the flag up */
    UTIL_SEQ_SetEvt ((1u << CFG_FLASH_MUTEX));
  }

  return error;
}

/* USER CODE BEGIN FD_WRAP_FUNCTIONS */
void HAL_GPIO_EXTI_Falling_Callback(uint16_t GPIO_Pin)
{
  HAL_GPIO_EXTI_Rising_Callback(GPIO_Pin);
}

/* USER CODE END FD_WRAP_FUNCTIONS */
